%% Задание 1
% Постройте три отрезка 
% (0,0)______(2,1),   (0,0)______(-1, 2),   (-2,-4)______(0,0).
figure("Name", "Задание 1", "NumberTitle","off");
title("Задание 1");
grid on;
hold on;
line([0;2],[0;1], 'Color', "k");
line([0;-1],[0;2], 'Color', "k");
line([-2,0],[-4,0], 'Color', "k");
axis equal;
axis([-2.5 2.5 -4.5 2.5]);
xlabel("X");
ylabel("Y");
text(-0.25, -0.25,"\bf(0, 0)");
text(1.75, 0.75,"\bf(2, 1)");
text(-1.25, 1.75,"\bf(-1, 2)");
text(-2.25, -4.25,"\bf(-2, -4)")

%% Задание 2
% Постройте три отрезка 
% (0,0)____(2,1),   (0,2)_____(2,0), (0,2)_____(3,0) 
% с помощью одной команды line.
figure("Name", "Задание 2", "NumberTitle","off");
title("Задание 2");
grid on;
hold on;
line([0,0,0;2,2,3],[0,2,2;1,0,0], 'Color', "k");
axis equal;
axis([-0.5 3.5 -0.5 2.5]);
xlabel("X");
ylabel("Y");
text(-0.25, -0.25,"\bf(0, 0)");
text(1.75, 0.75,"\bf(2, 1)");
text(-0.25, 1.75,"\bf(0, 2)");
text(1.75, -0.25,"\bf(2, 0)");
text(2.75, -0.25,"\bf(3, 0)")

%% Задание 3
% Создайте графическое окно для четырёх координатных плоскостей. 
% В третьей области постройте все три отрезка, в остальных - по одному. 
% Отрезки:
% (0,0)____(2,1) ,  (0,2)_____(2,0) ,  (0,2)_____(3,0) .
figure("Name", "Задание 3", "NumberTitle","off");
subplot(2, 2, 1);
title("Отрезок (0,0)____(2,1)");
grid on;
line([0;2],[0;1], 'Color', "k");
axis equal;
axis([-0.5 2.5 -0.5 2.5]);
xlabel("X");
ylabel("Y");
text(-0.25, -0.25,"\bf(0, 0)");
text(1.75, 0.75,"\bf(2, 1)");

subplot(2,2,2);
title("Отрезок (0,2)_____(2,0)");
grid on;
line([0;2],[2;0], 'Color', "k");
axis equal;
axis([-0.5 2.5 -0.5 2.5]);
xlabel("X");
ylabel("Y");
text(-0.25, 2.25,"\bf(0, 2)");
text(1.75, -0.25,"\bf(2, 0)");

subplot(2,2,3);
title("Все отрезки");
grid on;
hold on;
line([0,0,0;2,2,3],[0,2,2;1,0,0], 'Color', "k");
axis equal;
axis([-0.5 3.5 -0.5 2.5]);
xlabel("X");
ylabel("Y");
text(-0.25, -0.25,"\bf(0, 0)");
text(2, 1.25,"\bf(2, 1)");
text(-0.25, 2.25,"\bf(0, 2)");
text(1.75, -0.25,"\bf(2, 0)");
text(2.75, -0.25,"\bf(3, 0)")

subplot(2,2,4);
title("Отрезок (0,2)_____(3,0)");
grid on;
line([0;3],[2;0], 'Color', "k");
axis equal;
axis([-0.5 3.5 -0.5 2.5]);
xlabel("X");
ylabel("Y");
text(-0.25, 2.25,"\bf(0, 2)");
text(2.75, -0.25,"\bf(3, 0)");

%% Задание 4
% Постройте следующие векторы 
% (0,0)____(2,1), (0,2)_____(2,0),(0,2)_____(3,0). 
% Можно пользоваться quiver и line+plot по выбору. 
% Все векторы покрасьте в чёрный цвет, установите для них толщину 3.
figure("Name", "Задание 4", "NumberTitle","off");
title("Задание 4");
grid on;
hold on;
quiver(0,0,2,1,1,'LineWidth',3,"Color","k");
quiver(0,2,2,-2,1,'LineWidth',3,"Color","k");
quiver(0,2,3,-2,1,'LineWidth',3,"Color","k");
axis equal;
axis([-0.5 3.5 -0.5 2.5]);
xlabel("X");
ylabel("Y");
text(-0.25, -0.25,"\bf(0, 0)");
text(1.75, 1.25,"\bf(2, 1)");
text(-0.25, 1.75,"\bf(0, 2)");
text(1.75, -0.25,"\bf(2, 0)");
text(2.75, -0.25,"\bf(3, 0)")

%% Задание 5
% Изобразите векторы-орты координатных осей в пространстве:
% (орты  -  это единичные направляющие векторы) 
% (0, 0, 0) _____________(1, 0, 0)
% (0, 0, 0) _____________(0,1, 0)
% (0, 0, 0) _____________(0, 0, 1)
figure("Name", "Задание 5", "NumberTitle","off");
title("Задание 5");
grid on;
hold on;
quiver3(0,0,0,1,0,0,1);
quiver3(0,0,0,0,1,0,1);
quiver3(0,0,0,0,0,1,1);
axis equal;
axis([-0.5 1.5 -0.5 1.5 -0.5 1.5]);
xlabel("X");
ylabel("Y");
zlabel("Z");
text(-0.25, -0.25, -0.25, "\bf(0, 0, 0)");
text(1, -0.25, -0.25,"\bf(1, 0, 0)");
text(-0.25, 1.25, -0.25,"\bf(0, 1, 0)");
text(-0.25, -0.25, 1.25,"\bf(0, 0, 1)")

%% Задание 6
% Изобразите координатные оси двухмерного пространства X, Y  толщиной 3 
% (например, от 0 до 10), а орты изобразите черным цветом, толщиной 4.
figure("Name", "Задание 6", "NumberTitle","off");
title("Задание 6");
grid on;
hold on;
quiver(0,0,10,0,1,'LineWidth',3);
quiver(0,0,0,10,1,'LineWidth',3);
quiver(0,0,1,0,1,'LineWidth',4,"Color","k");
quiver(0,0,0,1,1,'LineWidth',4,"Color","k");
axis equal;
axis([-0.5 10 -0.5 10]);
text(-0.25, -0.25, "\bf(0, 0)");
text(1, 0.25,"\bf(1, 0)");
text(0.25, 1,"\bf(0, 1)");
text(-0.25, 5, "\bfY");
text(5, -0.25, "\bfX")

%% Задание 7
% Изобразите координатные оси трёхмерного пространства X, Y, Z толщиной 2 
% (например, от 0 до 10), а орты изобразите черным цветом, толщиной 4.
figure("Name", "Задание 7", "NumberTitle","off");
title("Задание 7");
grid on;
hold on;
quiver3(0,0,0,5,0,0,1,'LineWidth',2);
quiver3(0,0,0,0,5,0,1,'LineWidth',2);
quiver3(0,0,0,0,0,5,1,'LineWidth',2);
quiver3(0,0,0,1,0,0,1,'LineWidth',4,"Color","k");
quiver3(0,0,0,0,1,0,1,'LineWidth',4,"Color","k");
quiver3(0,0,0,0,0,1,1,'LineWidth',4,"Color","k");
axis equal;
axis([-0.5 7 -0.5 7 -0.5 7]);
text(-0.25, -0.25, -0.25, "\bf(0,0,0)");
text(1, 0.25, 0.25,"\bf(1,0,0)");
text(0.25, 1, 0.25,"\bf(0,1,0)");
text(0.25, 0.25, 1,"\bf(0,0,1)");
text(-0.25, 2.5, 0.25, "\bfY");
text(2.5, -0.25, 0.25,"\bfX");
text(-0.25, -0.25, 2.5, "\bfZ")

%% Задание 8
% Изобразите данные ниже отрезки, укажите координаты точек конца каждого отрезка на графике в виде (х,у). 
% С помощью команды axis([xmin xmax ymin ymax]) установите оптимальные границы координатных осей, 
% включите отображение координатной сетки, установите одинаковый масштаб по осям:
% а) line([-1;2],[ 3;-5]);    
% б) line([1,4;2,3],[-1,0;-3,-5])
figure("Name", "Задание 8", "NumberTitle","off");
title("Задание 8");
grid on;
hold on;
line([-1;2],[ 3;-5], 'Color', 'b');
line([1,4;2,3],[-1,0;-3,-5], 'Color', 'r');
axis equal;
axis([-1.5 4.5 -5.5 3.5]);
xlabel("X");
ylabel("Y");
text(-1.25, 3.25, "\bf(-1, 3)");
text(1.75, -4.75,"\bf(2, -5)");
text(0.75, -0.75,"\bf(1, -1)");
text(1.75, -3.25,"\bf(2, -3)");
text(3.75, 0.25,"\bf(4, 0)");
text(2.75, -4.75,"\bf(3, -5)");

%% Задание 9
% Изобразите правило треугольника на следующем примере.
% Даны три точки с координатами A(-2 0), B(1 2), C(1 -1). 
% Найдите векторы АВ, ВС, AC (например, АВ=В-А). 
% Убедитесь, что АВ+ВС=AC. Изобразите векторы АВ и ВС синим 
% и АС красным, выделите и обозначьте вершины (команда text).
figure("Name", "Задание 9", "NumberTitle","off");
title("Задание 9");
grid on;
hold on;
quiver(-2,0,3,2,1,'Color',"b");
quiver(1,2,0,-3,1,'Color',"b");
quiver(-2,0,3,-1,1,'Color',"r");
axis equal;
axis([-2.5 1.5 -1.5 2.5]);
xlabel("X");
ylabel("Y");plot(-2,0,'.', 'LineWidth',4)
plot(-2,0,'.', 'LineWidth',4)
plot(1,2,'.', 'LineWidth',4)
plot(1,-1,'.', 'LineWidth',4)
text(-2, -0.25, "A(-2, 0)");
text(1, 2.25, "B(1, 2)");
text(1, -1.25, "C(1, -1)");
text(-2, 1, "AB = B - A = [3;2]");
text(0.25, 0.5, "BC = C - B = [0;-3]");
text(-1, -0.75, "AC = C - A = [3;-1]");

%% Задание 10
% Дан параллелограмм ABCD, известны координаты трёх его точек: 
% A(-2 0), B(1 2), C(1 -1). Найдите координаты четвертой вершины D (x,y) 
% параллелограмма, учитывая требования к векторам ниже.
% Разбейте графическое окно на две области.
% В первом изобразите параллелограмм с помощью line ABCD, выделите и обозначьте вершины (команда text).
% Найдите векторы AB, DC, AD, BC . 
% Докажите, что пары векторов AB и DC, AD и  BC  коллинеарны, сонаправлены и равны.
% Во втором графическом окне покажите правило параллелограмма:
% AB+AD=AC.
% Изобразите векторы АВ и  AD синим и АС красным, 
% остальные стороны параллелограмма ВС и CD - чёрным.
figure("Name", "Задание 10", "NumberTitle","off");
subplot(2, 1, 1);
grid on;
hold on;
line([-2,1,-2,4;1,4,1,1],[0,2,0,1;2,1,-1,-1]);
axis equal;
axis([-2.5 4.5 -1.5 2.5]);
xlabel("X");
ylabel("Y");
plot(-2,0,'.', 'LineWidth',4)
plot(1,2,'.', 'LineWidth',4)
plot(1,-1,'.', 'LineWidth',4)
plot(4,1,'.', 'LineWidth',4)
text(-2, -0.25, "A(-2, 0)");
text(1, 2.25, "B(1, 2)");
text(1, -1.25, "C(1, -1)");
text(4, 0.75, "D(4;1)");
text(-4, 1.25, "AB = B-A = [3;2] = 1*CD = CD");
text(3, 1.5, "BD = D-B = [3;-1] = 1*AC = AC");
text(2, 0, "CD = D-C = [3;2] = 1*AB = AB");
text(-3, -0.75, "AC = C-A = [3;-1] = 1*BD = BD");

subplot(2,1,2);
grid on;
hold on;
line([1;4],[2;1],'Color',"k");
line([1;4],[-1;1],'Color',"k");
quiver(-2,0,3,2,1,'Color',"b");
quiver(-2,0,3,-1,1,'Color',"b");
quiver(-2,0,6,1,1,'Color',"r");
axis equal;
axis([-2.5 4.5 -1.5 2.5]);
xlabel("X");
ylabel("Y");
text(-2, -0.25, "A(-2, 0)");
text(1, 2.25, "B(1, 2)");
text(1, -1.25, "C(1, -1)");
text(4, 0.75, "D(4;1)");
text(-3.5, 1.25, "AB = B-A = [3;2]");
text(-3, -0.75, "AC = C-A = [3;-1]");
text(1, 0, "AD = AB + AC = [6;1]");

%% Задание 11
% Вычислите сумму двух векторов a1=(2;4;6), b1=(3;5;2).
% Вычислите разность двух векторов a2=(7;6;5), b2=(3;5;2).
% Сделайте геометрическую интерпретацию в двух областях одного графического окна. 
% Пометьте векторы полужирным шрифтом (команда text,  {\bf})
figure("Name", "Задание 11", "NumberTitle","off");
subplot(1, 2, 1);
grid on;
hold on;
quiver3(0,0,0,2,4,6,1);
quiver3(2,4,6,3,5,2,1);
quiver3(0,0,0,5,9,8,1);
axis equal;
axis([-0.5 7 -0.5 9.5 -0.5 8.5]);
xlabel("X");
ylabel("Y");
zlabel("Z");
text(1, 2, 3, "\bfa1=(2;4;6)");
text(2.25, 4.5, 7, "\bfb1=(3;5;2)");
text(2.5, 4, 3, "\bfa1+b1=(5;9;8)");

subplot(1,2,2)
grid on;
hold on;
quiver3(0,0,0,7,6,5,1);
quiver3(7,6,5,-3,-5,-2,1);
quiver3(0,0,0,4,1,3,1);
axis equal;
axis([-0.5 7.5 -0.5 6.5 -0.5 5.5]);
xlabel("X");
ylabel("Y");
zlabel("Z");
text(3.5, 3, 2.5, "\bfa2=(7;6;5)");
text(5, 2, 4, "\bf-b2=(-3;-5;-2)");
text(2, 0, 1.5, "\bfa2-b2=a2+(-b2)=(4;1;3)");
